driver-tests/bpelse/dynamicpartnerlink/SendInternalEPRCallbackInfo/AsynchronousClient/src/asyncResponse.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="asyncResponse" targetNamespace="http://j2ee.netbeans.org/wsdl/SendInternalEPRCallbackInfo/asyncResponse"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:tns="http://j2ee.netbeans.org/wsdl/SendInternalEPRCallbackInfo/asyncResponse" 
    xmlns:ns="http://xml.netbeans.org/schema/Common" 
    xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/SendInternalEPRCallbackInfo/asyncResponse">
            <xsd:import namespace="http://xml.netbeans.org/schema/Common" schemaLocation="Common.xsd"/>
        </xsd:schema>
    </types>
    <message name="asyncResponseOperationRequest">
        <part name="part1" element="ns:typeA"/>
    </message>
    <portType name="asyncResponsePortType">
        <operation name="asyncResponseOperation">
            <input name="input1" message="tns:asyncResponseOperationRequest"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="asyncResponse">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="asyncResponsePortTypeRole" portType="tns:asyncResponsePortType"/>
    </plnk:partnerLinkType>
</definitions>

