driver-tests/bpelse/dynamicpartnerlink/SendInternalEPRCallbackInfo/AsynchronousClientApp/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <typeA xmlns="http://xml.netbeans.org/schema/Common" xmlns:com="http://xml.netbeans.org/schema/Common" xmlns:msgns="http://j2ee.netbeans.org/wsdl/AsynchronousClient/AsynchronousClientWS" xmlns:ns0="http://j2ee.netbeans.org/wsdl/SendInternalEPRCallbackInfo/asyncRequest" xmlns:ns1="http://j2ee.netbeans.org/wsdl/SendInternalEPRCallbackInfo/asyncResponse">
      <com:paramA>Hello, Internal EPR World!</com:paramA>
    </typeA>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>